#pragma once

/*
 * Configuration:
 *
 * UW_TYPE_CAPACITY        default: 1 << (sizeof(UwTypeId) * 8)
 * UW_INTERFACE_CAPACITY   default: 256
 */

#include <limits.h>
#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <uchar.h>

#include <libpussy/allocator.h>

#ifdef __cplusplus
extern "C" {
#endif


#define _UWC_LENGTH_OF(array)  (sizeof(array) / sizeof((array)[0]))  // get array length

/****************************************************************
 * Assertions and panic
 *
 * Unlike assertions from standard library they cannot be
 * turned off and can be used for input parameters validation.
 */

#define uw_assert(condition) \
    ({  \
        if (!(condition)) {  \
            uw_panic("UW assertion failed at %s:%s:%d: " #condition "\n", __FILE__, __func__, __LINE__);  \
        }  \
    })

[[noreturn]]
void uw_panic(char* fmt, ...);

/****************************************************************
 * UwValue
 */

// Type for type id.
typedef uint16_t UwTypeId;

// Integral types
typedef nullptr_t  UwType_Null;
typedef bool       UwType_Bool;
typedef int64_t    UwType_Signed;
typedef uint64_t   UwType_Unsigned;
typedef double     UwType_Float;

#define UW_SIGNED_MAX  0x7fff'ffff'ffff'ffffL

typedef struct {
    /*
     * Extra data for UwValue.
     * This structure is variable size.
     */
    unsigned refcount;
} _UwExtraData;

/*
 * Extra data for compound UwValue is a bit more complicated.
 *
 * Traversing cyclic references requires the list of parents with reference counts.
 * Parent reference count is necessary for cases when, say, a list contains items
 * pointing to the same other list.
 */

#define UW_PARENTS_CHUNK_SIZE  4

typedef struct {
    /*
     * Pointers and refcounts on the list of parents are allocated in chunks
     * because alignment for pointer and integer can be different.
     */
    struct __UwCompoundData* parents[UW_PARENTS_CHUNK_SIZE];
    unsigned parents_refcount[UW_PARENTS_CHUNK_SIZE];
} _UwParentsChunk;

// a couple of forward declarations just for less verbose pointer types to self
struct __UwCompoundData;
typedef struct __UwCompoundData _UwCompoundData;

struct __UwCompoundData {
    /*
     * Extra data for compound UwValue.
     * This structure is capable to hold two pointers without allocating a list.
     * This structure is variable size.
     */
    unsigned refcount;
    bool destroying;
    struct {
        union {
            ptrdiff_t using_parents_list: 1;    // given that pointers are aligned, we use least significant bit for a flag
            _UwCompoundData* parents[2];        // using_parents_list == 0, using pointers as is
            struct {
                _UwParentsChunk* parents_list;  // using_parents_list == 1, this points to the list of other parents
                unsigned num_parents_chunks;
            };
        };
        unsigned parents_refcount[2];
    };
};


typedef struct { uint8_t v[3]; } uint24_t;  // always little-endian

// make sure largest C type fits into 64 bits
static_assert( sizeof(long long) <= sizeof(uint64_t) );

union __UwValue {
    /*
     * 128-bit value
     */

    UwTypeId /* uint16_t */ type_id;

    struct {
        // integral types
        UwTypeId /* uint16_t */ _integral_type_id;
        uint8_t carry;  // for integer arithmetic
        uint8_t  _integral_pagging_1;
        uint32_t _integral_pagging_2;
        union {
            // Integral types
            UwType_Bool     bool_value;
            UwType_Signed   signed_value;
            UwType_Unsigned unsigned_value;
            UwType_Float    float_value;
        };
    };

    struct {
        // charptr and ptr
        UwTypeId /* uint16_t */ _charptr_type_id;
        uint8_t charptr_subtype; // see UW_CHARPTR* constants
        uint8_t  _charptr_padding_1;
        uint32_t _charptr_pagging_2;
        union {
            // C string pointers for UwType_CharPtr
            char*     charptr;
            char8_t*  char8ptr;
            char32_t* char32ptr;

            // void*
            void* ptr;
        };
    };

    struct {
        // values with allocated extra data
        UwTypeId /* uint16_t */ _extradata_type_id;
        uint16_t _extradata_pagging_1;
        uint32_t _extradata_pagging_2;
        _UwExtraData* extra_data;
    };

    struct {
        // status
        UwTypeId /* uint16_t */ _status_type_id;
        int16_t uw_errno;
        uint32_t status_code;
        _UwExtraData* status_data;
    };

    struct {
        // embedded string
        UwTypeId /* uint16_t */ _emb_string_type_id;
        uint8_t str_embedded:1,       // the string data is embedded into UwValue
                str_embedded_char_size:2;
        uint8_t str_embedded_length;  // length of embedded string
        union {
            uint8_t  str_1[12];
            uint16_t str_2[6];
            uint24_t str_3[4];
            uint32_t str_4[3];
        };
    };

    struct {
        // allocated string
        UwTypeId /* uint16_t */ _string_type_id;
        uint8_t _x_str_embedded:1;  // zero for allocated string
        uint8_t _str_padding[5];
        void* string_data;
    };
};

typedef union __UwValue _UwValue;

// make sure _UwValue structure is correct
static_assert( offsetof(_UwValue, charptr_subtype) == 2 );
static_assert( offsetof(_UwValue, status_code)     == 4 );

static_assert( offsetof(_UwValue, bool_value) == 8 );
static_assert( offsetof(_UwValue, charptr)    == 8 );
static_assert( offsetof(_UwValue, extra_data) == 8 );
static_assert( offsetof(_UwValue, status_data) == 8 );
static_assert( offsetof(_UwValue, string_data) == 8 );

static_assert( offsetof(_UwValue, str_embedded_length) == 3 );
static_assert( offsetof(_UwValue, str_1) == 4 );
static_assert( offsetof(_UwValue, str_2) == 4 );
static_assert( offsetof(_UwValue, str_3) == 4 );
static_assert( offsetof(_UwValue, str_4) == 4 );

static_assert( sizeof(_UwValue) == 16 );

typedef _UwValue* UwValuePtr;
typedef _UwValue  UwResult;  // alias for return values

// automatically cleaned value
#define _UW_VALUE_CLEANUP [[ gnu::cleanup(uw_destroy) ]]
#define UwValue _UW_VALUE_CLEANUP _UwValue

// Built-in types
#define UwTypeId_Null        0
#define UwTypeId_Bool        1U
#define UwTypeId_Int         2U  // abstract integer
#define UwTypeId_Signed      3U  // subtype of int, signed integer
#define UwTypeId_Unsigned    4U  // subtype of int, unsigned integer
#define UwTypeId_Float       5U
#define UwTypeId_String      6U
#define UwTypeId_CharPtr     7U  // container for static C strings
#define UwTypeId_List        8U  // always has extra data
#define UwTypeId_Map         9U  // always has extra data
#define UwTypeId_Status     10U  // extra_data is optional
#define UwTypeId_Struct     11U
#define UwTypeId_Ptr        12U  // void*

// char* sub-types
#define UW_CHARPTR    0
#define UW_CHAR8PTR   1
#define UW_CHAR32PTR  2

